export const LINE_COLORS: Record<string, string> = {
  '1호선': '#0052A4',
  '2호선': '#009B3E',
  '3호선': '#EF7C1A',
  '4호선': '#00A2D1',
  '5호선': '#996CAC',
  '6호선': '#CD7C2F',
  '7호선': '#747F00',
  '8호선': '#E6186C',
  '9호선': '#BDB092',
};

export const LINE_IDS: Record<string, string> = {
  '1호선': '1001',
  '2호선': '1002',
  '3호선': '1003',
  '4호선': '1004',
  '5호선': '1005',
  '6호선': '1006',
  '7호선': '1007',
  '8호선': '1008',
  '9호선': '1009',
};

export const LINE_NAMES: Record<string, string> = {
  '1001': '1호선',
  '1002': '2호선',
  '1003': '3호선',
  '1004': '4호선',
  '1005': '5호선',
  '1006': '6호선',
  '1007': '7호선',
  '1008': '8호선',
  '1009': '9호선',
};
